Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_abroad/leaving_ireland/other_useful_documents.html.txt.tmx
Source language: en
Languages: ga

source: Documentation and other requirements when leaving Ireland
ga: Cáipéisí úsáideacha le tabhairt leat agus tú ag taisteal thar lear

source: • Documents to bring with you
ga: • Doiciméid a thabhairt leat

source: If you are leaving Ireland, you may be travelling for reasons of work, study, holiday or retirement abroad
ga: Má tá Éire á fágáil agat, d’fhéadfá a bheith ag taisteal ar chúiseanna oibre, staidéir, saoire nó scoir thar lear

source: Whatever it is you intend to do, you will need to take with you certain documentation (for example, proof of your citizenship, identity, address in Ireland)
ga: Cibé rud atá beartaithe agat a dhéanamh, beidh cáipéisíocht áirithe le tabhairt leat (mar shampla, cruthúnas saoránachta, céannachta, agus do sheoladh in Éirinn)

source: The Department of Foreign Affairs and Trade has developed a free smartphone app called TravelWise which has travel advice and consular information on 200 countries
ga: Bíonn sé níos éasca teacht ar na doiciméid seo i gcónaí nuair atá tú fós in Éirinn seachas iarracht a dhéanamh iad a fháil nuair a bhogtar thar lear

source: Documents to bring with you
ga: Doiciméid a thabhairt leat

source: It is always highly recommended that you bring your passport with you, even if you are travelling to the UK and your passport is not a requirement for travel
ga: Moltar go láidir do phas a thabhairt leat i gcónaí, fiú más ag taisteal chuig an RA atá tú agus nach bhfuil do phas mar riachtanas taistil

source: In fact, given Ireland is not a member of the Schengen Agreement, you will find that you are required to carry your passport when travelling to most other countries
ga: I bhfírinne, toisc nach bhfuil Éire mar bhall de Chomhaontú Schengen, aimseoidh tú go bhfuil sé riachtanach do phas a iompar nuair atá taisteal á dhéanamh go mórchuid thíortha eile

source: If you need information about applying for an Irish passport you can find this information elsewhere on this site
ga: Má tá eolas ag teastáil uait faoi iarratas a dhéanamh ar phas Éireannach, tá an t-eolas seo ar fáil in áit eile ar an láithreán gréasáin

source: In addition to your passport, other useful documents include:
ga: De bharríocht do phas, ar cháipéisí úsáideacha eile tá:

source: • Your driving licence and/or international driving permit
ga: • Do cheadúnas tiomána agus/nó cheadúnas tiomána idirnáisiúnta

source: • Any visas or work permits you may need
ga: • Aon víosa nó ceadúnas oibre a d'fhéadfadh a bheith ag teastáil uait

source: • European Health Insurance Card and/or other documents relating to health insurance
ga: • An Cárta Eorpach Árachas Sláinte nó aon cháipéisí eile a bhaineann le árachas slainte

source: • Any relevant certificates from education or training courses you have completed
ga: • Aon teastaisí oideachais nó ó chúrsaí traenála atá bainte amach agat

source: • Contact names and numbers of your family/friends/next-of-kin in Ireland
ga: • Ainmneacha agus uimhreacha teangmhála do chlann agus/nó do cháirde in Éirinn

source: If you are going to remote areas where you will be far from an Irish embassy, leave two passport photographs and two signatures, ideally on a passport application form, with friends in Ireland or near an Irish embassy
ga: Má tá tú ag taisteal go ceantair iargúlta atá i bhfad ó ambasáid Éireannach, fág dhá ghrianghraf pas agus dhá shíniú, ar fhoirm iarratais ar phas is fearr, le cairde in Éirinn nó ata in aice le hambasáid Éireannach

source: If your passport is lost or stolen this could speed up the process of replacing it
ga: Má chailltear nó má ghoidtear do phas, ba chóir go gcuirfeadh sé seo luas faoin bpróiseas athsholáthraithe

source: Before you travel, it can be useful to make photocopies of the most important of these documents
ga: Bíonn sé úsaideach fótachóipeanna a dhéanamh de na cáipéisí is tábhachtaí

source: Carry the photocopies separately so that you will have some form of identification in the event that they are stolen
ga: Coinnigh na cóipeanna scartha ionas go mbeidh cinéal éigin cáipéis aitheantas agat sa gcás is go ndéantar tú a robáil

source: If you are travelling in countries where there are a lot of restrictions, it can be useful to bring a number of passport photographs with you, for use on additional visas and permits
ga: Ma tá tú ag taisteal i dtír ina bhfuil go leor srianta, d'fhéadfadh sé a bheith úsáideach roinnt griangrafanna pas a thabairt leat, chun úsáid i gcomhair aon víosa nó ceadúnas de bhreis a d'fhéadfadh a bheith ag teastáil uait

source: When you are abroad, you may need to use Irish documents, for example, a birth certificate, either for personal or business reasons
ga: Nuair a bhíonn tú thar lear, b’fhéidir gur gá duit cáipéisí Éireannacha a úsáid, mar shampla, teastas breithe, cibé acu ar chúiseanna pearsanta nó gnó

source: You may be asked to have them authenticated by the Department of Foreign Affairs and Trade
ga: Féadtar iarraidh ort iad a fhíordheimhniú ag an Roinn Gnóthaí Eachtracha agus Trádála

source: Authenticating a document means verifying that a signature, seal or stamp on a document is genuine
ga: Is éard atá i gceist le cáipéis a fhíordheimhniú ná a fhíorú go bhfuil síniú, séala nó stampa ar cháipéis fíor

source: Another type of authentication is an apostille stamp which is an international certification
ga: Saghas eile d’fhíordheimhniú is ea stampa apastaile ar deimhniúchán idirnáisiúnta é

source: It authenticates or legally certifies a document and it may be required by countries that have acceded to the Hague Convention
ga: Déanann sé cáipéis a fhíordheimhniú nó a dheimhniú go dlíthiúil agus féadfaidh tíortha a d’aontaigh ar Choinbhinsiún na Háige é a iarraidh

source: You can find more information about authenticating documents on dfa.ie
ga: Is féidir leat teacht ar thuilleadh faisnéise faoi cháipéisí a fhíordheimhniú ar dfa.ie

source: If you are planning to travel to a country for which you need a visa, you may be asked to provide fingerprints as part of your visa application
ga: Má tá sé ar intinn agat taisteal go tír óna dteastaíonn víosa uait, féadtar iarraidh ort méarloirg a sholáthar mar chuid de d’iarratas ar víosa

source: To get a certificate of your fingerprints you should contact your local Garda station to find out which Garda stations provide this service
ga: Chun deimhniú do mhéarlorg a fháil, ba cheart duit teagmháil a dhéanamh le do stáisiún áitiúil Gardaí lena dheimhniú cén stáisiúin a sholáthraíonn an tseirbhís seo

source: It involves taking your fingerprints and giving you a card with a set of your fingerprints and stamped by the Garda station
ga: Is éard atá i gceist leis ná do mhéarloirg a ghlacadh agus cárta a thabhairt duit ar a bhfuil sraith de do mhéarloirg atá stampáilte ag an stáisiún Gardaí

source: The Department of Foreign Affairs and Trade recommends that you make a note of the contact details of the nearest Irish embassy or consulate while you are abroad in case you need to contact them urgently
ga: Molann an Roinn Gnóthaí Eachtracha agus Trádála go dtógfá nóta de shonraí teagmhála na hambasáide nó consalachta Éireannaigh is cóngaraí nuair atá tú thar lear, má tharlaíonn sé go mbeadh ort teagmháil a dhéanamh leo go práinneach

source: You are also advised to leave your own contact details with someone at home who can pass them to the Consular Section of the Department of Foreign Affairs and Trade in the event of an emergency
ga: Tugtar comhairle duit freisin do shonraí teagmhála féin a fhágáil le duine sa bhail a bheidh ábalta iad a thabhairt do Rannóg Consalachta na Roinne Gnóthaí Eachtracha agus Trádála i gcás éigeandála

source: You could also register your contact details with the Department of Foreign Affairs and Trade
ga: Is féidir leat freisin do shonraí teagmhála féin a chlárú sa Roinn Gnóthaí Eachtracha agus Trádála
